Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་ཉོན་མོངས་པ་མེད་པར་བྱ་བར་འདོད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་གཡེལ་ན་དེ་མྱུར་དུ་ཉན་ཐོས་ཀྱི་ས་འམ་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བར་འགྱུར་རོ། །
en: If bodhisattvas were to become concerned only with eliminating their own afflictions and shied away from eliminating the afflictions of all beings, they would swiftly fall to the level of either a hearer or a solitary buddha.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ལ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པ་དེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་སྟོབས་དང་ལྡན་པར་འགྱུར་ཏེ
en: Śāradvatīputra, from this teaching you should understand that the more bodhisattvas examine beings’ afflictive emotions through appropriate mental engagement, the stronger they become.

source: གལ་ཏེ་དེ་ལྟ་བུ་ཐོས་ནས་མི་སྐྲག་ན་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རིག་པར་བྱའོ། །
en: If someone can hear this without being intimidated, that person must be recognized as a bodhisattva who is skilled in means.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་སྦྲུལ་གདུག་པའི་ཕྲུ་གུ་ནི་གྲོགས་མི་དགོས་པར་ཟའོ། །
en: “Śāradvatīputra, to draw another analogy, a young poisonous snake can hunt without any assistance.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ཡང་གྲོགས་མི་དགོས་པར་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཡང་དག་པར་སྡུད་དེ།
en: Likewise, Śāradvatīputra, novice bodhisattvas can amass the branches of awakening without any assistance.

source: གཅིག་པུ་གཉིས་སུ་མེད་པར་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཡང་དག་པར་སྡུད་དོ། །
en: Even on their own, they can themselves amass the branches of awakening.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྲིན་བུ་མེ་ཁྱེར་བརྒྱ་སྟོང་གིས་ཀྱང་ཉི་མའི་འོད་ཟིལ་གྱིས་གནོན་མི་ནུས་སོ། །
en: “Śāradvatīputra, to draw another analogy, even a hundred thousand fireflies cannot outshine the light of the sun.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་འོད་ཟིལ་གྱིས་གནོན་མི་ནུས་སོ། །
en: Likewise, Śāradvatīputra, the entirety of afflictions cannot outshine the light of a bodhisattva’s insight.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། དུག་གི་གཉེན་པོ་ནད་མེད་པར་བྱེད་པ་ཆུང་ངུས་ཀྱང་དུག་ཤིན་ཏུ་མང་པོ་ཞི་བར་བྱེད་དོ། །
en: “Śāradvatīputra, to draw another analogy, even a small amount of a healing antidote to poison can ameliorate a wide variety of poisons.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ནད་མེད་པ་ཆུང་ངུས་ཀྱང་ཉོན་མོངས་པའི་དུག་མང་པོ་ཤིན་ཏུ་ཞི་བར་བྱེད་དོ། །
en: Likewise, Śāradvatīputra, even a small amount of a bodhisattva’s healing insight can ameliorate a wide variety of poisonous afflictive emotions.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བར་སྣང་ལས་རོ་གཅིག་པའི་ཆུའི་རྒྱུན་འབབ་པ་བབ་ནས་སྣོད་ཀྱི་བྱེ་བྲག་གིས་རོ་བྲོ་བ་ཐ་དད་དུ་འགྱུར་རོ། །
en: “Śāradvatīputra, to draw another analogy, water falling from the sky has a consistent taste but will end up taking on a great variety of tastes in different containers.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་རོ་གཅིག་པ་ཡང་དག་པར་བསྒྲུབས་ཏེ། སེམས་ཅན་གྱི་དབང་པོ་ཐ་དད་པ་རྣམས་ལ་ཆོས་བསྟན་པ་ཐ་དད་པ་སྟོན་ཏོ། །
en: Likewise, Śāradvatīputra, bodhisattvas accomplish the consistent taste of liberated wisdom but give diverse Dharma teachings according to the diverse faculties of beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གང་དུ་འཛམ་བུའི་ཆུ་བོའི་གསེར་བྱུང་བ་དེར་རིན་པོ་ཆེ་ཐམས་ཅད་མོག་མོག་པོར་འགྱུར་རོ། །
en: “Śāradvatīputra, to draw another analogy, wherever the gold of the Jambu River is found, all other precious jewels appear dull.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་བྱུང་བ་དེར། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་མོག་མོག་པོར་འགྱུར་རོ། །
en: Likewise, Śāradvatīputra, anywhere the precious bodhisattvas are, all hearers and solitary buddhas appear dull.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱུང་བ་དེའི་ཚེ། རྒྱལ་ཕྲན་ཐམས་ཅད་དེ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Śāradvatīputra, to draw another analogy, when a universal monarch is present, all lesser kings will pay obeisance to him.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་གང་གི་ཚེ་ཆོས་ཀྱི་རྒྱལ་པོའི་བུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེའི་ཚེ། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བྱ་བར་འགྱུར་རོ། །
en: Likewise, Śāradvatīputra, when the children of the Dharma King develop the mind of awakening, the entire world of gods, humans, and asuras will pay them homage.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བསོད་ནམས་མ་བྱས་པའི་སེམས་ཅན་རྣམས་ལ་དབྱིག་གི་ཆར་མི་འབབ་པོ། །
en: “Śāradvatīputra, to draw another analogy, wealth does not come to beings who have not created the merit for it.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་སེམས་མི་སྐྱེའོ།། །།
en: Likewise, Śāradvatīputra, the mind of awakening will not arise in those who have not developed roots of virtue.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བུ་རམ་ཤིང་གི་ས་བོན་མེད་པར་ཤ་ཁ་ར་མི་འབྱུང་ངོ་། །
en: “Śāradvatīputra, to draw another analogy, molasses does not come about without sugarcane seeds.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ས་བོན་མེད་པར་བླ་ན་མེད་པར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མི་འགྲུབ་བོ། །
en: Likewise, Śāradvatīputra, bodhisattvas will not accomplish unsurpassed and perfect awakening without the seed of the mind of awakening.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྨན་གྱི་རྒྱལ་པོ་འཚོ་བྱེད་ཀྱིས་གང་སྨན་དུ་མི་མཐོང་བའི་གཟུགས་སུ་སྣང་བ་དེ་གང་ཡང་མེད་དོ། །
en: “Śāradvatīputra, to draw another analogy, given the healing skill of the king of physicians, there is nothing that does not appear as medicine.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་གང་བྱང་ཆུབ་ཏུ་མི་མཐོང་བའི་ཆོས་སུ་སྣང་བ་དེ་གང་ཡང་མེད་དོ། །
en: Likewise, Śāradvatīputra, for bodhisattvas who experience the perfection of insight there is no phenomenon that is not seen in terms of awakening.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་གྱིས་ཉི་མ་དང་ཟླ་བའི་གཞལ་མེད་ཁང་གི་ལམ་གྱི་རིམ་པ་རྒྱུན་གཅོད་པར་མི་ནུས་སོ། །
en: “Śāradvatīputra, to draw another analogy, Rāhu, lord of the asuras, cannot permanently interrupt the progression of the chariots of the sun and moon.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བདུད་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་ཀུན་ཏུ་གཅོད་པར་མི་ནུས་སོ། །
en: Likewise, Śāradvatīputra, not even all the māras could completely interrupt a bodhisattva’s diligent progression along the path of awakening.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ནི་ནམ་མཁའ་ལ་གཞལ་མེད་ཁང་ན་གནས་སོ། །
en: “Śāradvatīputra, to draw another analogy, gods who play around in the form realm live in celestial mansions in the sky.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཟབ་མོ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡང་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་དེ་དང་འདྲ་བ་ཉིད་དོ། །
en: Likewise, Śāradvatīputra, for bodhisattvas who play around in the profound, all phenomena are equivalent to space and are like unsurpassed and perfect awakening.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྣོད་དུ་བྱེད་པ་ཇི་སྙེད་པ་དེ་སྙེད་དུ་ནམ་མཁའ་འཇུག་ཀྱང་ནམ་མཁའ་ནི་བྲི་བའམ་གང་བ་མེད་དོ། །
en: “Śāradvatīputra, to draw another analogy, even though space can enter into anything that functions as a container, space neither grows nor shrinks.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་བསྔོ་བའི་སྟོབས་ཇི་སྙེད་པ་དེ་སྙེད་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་འཛིན་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་འབྲི་བའམ་གང་བ་མེད་དོ། །
en: Likewise, Śāradvatīputra, the extent of a bodhisattva’s strength of dedication determines the extent to which they take hold of the qualities of buddhahood. Yet the qualities of buddhahood neither increase nor decrease.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུའི་སྟོབས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་ནམ་མཁའ་ལ་མདའ་འཕངས་པ་འགྲོ་ཡང་ནམ་མཁའ་ལ་མཐའ་ཐུག་པ་གང་ཡང་མེད་དོ། །
en: “Śāradvatīputra, to draw another analogy, an archer’s strength will determine how far an arrow travels when shot into space. Yet in space the arrow meets no end.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་དད་པའི་སྟོབས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་མོས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་མཐའ་ཐུག་པ་གང་ཡང་མེད་དོ། །
en: Likewise, Śāradvatīputra, the extent of a bodhisattva’s strength of faith determines the extent to which they aspire to the qualities of buddhahood. Yet, they will not reach any end of the qualities of buddhahood.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྫ་མཁན་གྱིས་སྣོད་དུ་མ་བྱས་པ་དག་སྣོད་ཀྱི་མིང་མི་འཐོབ་པོ། །
en: “Śāradvatīputra, to draw another analogy, vessels not fashioned by a potter cannot rightly be called vessels.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་དགེ་བའི་རྩ་བ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་མ་བསྔོས་པ་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་མི་འཐོབ་པོ། །
en: Likewise, Śāradvatīputra, roots of virtue not dedicated toward awakening cannot rightly be called perfections.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སུས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མཐོང་བ་དེ་ཕྱིས་རྒྱལ་ཕྲན་ཐམས་ཅད་ལ་རེ་བར་མི་བྱེད་དོ། །
en: “Śāradvatīputra, to draw another analogy, anyone who beholds a universal monarch will no longer put their hopes in lesser kings.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་སུས་ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དེ་ཕྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་རེ་བར་མི་བྱེད་དོ། །
en: Likewise, Śāradvatīputra, anyone who beholds the Thus-Gone One, the Dharma King, will no longer put their hopes in any hearer or solitary buddha.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བ་ལང་གི་རྗེས་ཀྱི་ཆུ་ལས་རིན་པོ་ཆེ་ཐམས་ཅད་མི་འབྱུང་ངོ་། །
en: “Śāradvatīputra, to draw another analogy, no jewels come from the water in an ox’s hoof print.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཚུལ་ཁྲིམས་ལས་དཀོན་མཆོག་གསུམ་པོ་དག་མི་འབྱུང་ངོ་། །
en: Likewise, Śāradvatīputra, the Three Jewels do not arise from the hearers’ discipline.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོ་ལས་རིན་པོ་ཆེ་ཐམས་ཅད་འབྱུང་ངོ་། །
en: “Śāradvatīputra, to draw another analogy, all jewels come from the great ocean.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་ཐོས་པའི་རྒྱ་མཚོ་ལས་སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་སྟེ་དཀོན་མཆོག་གསུམ་པོ་དག་འབྱུང་ངོ་། །
en: Likewise, Śāradvatīputra, the Three Jewels of Buddha, Dharma, and Saṅgha all come from the bodhisattvas’ oceanic discipline and learning.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱལ་པོའི་བུ་བཙས་ནས་རིང་པོ་མ་ལོན་པ་ནི་རྒྱལ་པོ་ཞེའམ་རྒྱལ་པོ་མ་ཡིན་པ་ཞེས་ཀྱང་མི་རྗོད་དོ། །
en: “Śāradvatīputra, to draw another analogy, in the time following a prince’s birth, he is not called either the king or not the king.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ལ་ཡང་སངས་རྒྱས་ཞེའམ། སངས་རྒྱས་མ་ཡིན་པ་ཞེས་ཀྱང་མི་རྗོད་དོ། །
en: Likewise, Śāradvatīputra, a novice bodhisattva is not called the buddha or not the buddha.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་བྱི་དོར་མ་བྱས་པ་ལ་ནི་མངོན་པར་འདུ་བྱ་བར་མི་འགྱུར་རོ། །
en: “Śāradvatīputra, to draw another analogy, a precious jewel cannot perform its function without being polished.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ཡང་ཆོས་བསྟན་པ་ལ་འཇིགས་པ་མེད་པ་མ་ཡིན་ནོ། །
en: Likewise, Śāradvatīputra, novice bodhisattvas are not without fear of the Dharma teachings.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་བྱི་དོར་བྱས་ཏེ་འོད་གསལ་བ་ནི་དགའ་བ་ཡང་དག་པར་སྐྱེད་པ་ཡིན་ནོ། །
en: “Śāradvatīputra, to draw another analogy, when a precious jewel has been polished, its luster arouses delight.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡུན་རིང་པོ་སྤྱད་པ་ཆོས་བསྟན་པ་རྣམས་ལ་འཇིགས་པ་མེད་པ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བ་ཡང་དག་པར་སྐྱེད་པ་ཡིན་ནོ། །
en: Likewise, Śāradvatīputra, bodhisattvas who have undergone lengthy training and have no fear of the Dharma teachings arouse the delight of all beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་ནི་ཆུང་ངུ་ཡང་ཁྱད་དུ་མི་གསད་དོ། །
en: “Śāradvatīputra, to draw another analogy, even a tiny precious gem should not be disregarded.

source: དེ་ཆུང་དུ་ཟིན་ཀྱང་གནས་ཁང་ངམ་ཁྱིམ་འམ་ཁང་པར་བཅུག་ན་དེ་ཐམས་ཅད་སྣང་བར་བྱེད་དོ། །
en: Even though it is tiny, if it is placed in any dwelling, house, or home, it will completely illuminate it.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ལ་ཡང་བརྙས་པར་མི་བྱའོ། །
en: Likewise, Śāradvatīputra, even novice bodhisattvas should not be denigrated.

source: དེ་བྱང་ཆུབ་ཐོབ་ནས་སངས་རྒྱས་ཀྱི་འོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་འགྱུར་བའི་ཕྱིར་རོ། །
en: Once they attain awakening, the brilliance of their buddhahood will expand to fill all buddha realms.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནོར་བུ་རིན་པོ་ཆེ་གང་དག་རིན་ཐང་མེད་པ་དེ་དག་ནི་ཡང་མ་དཔྱད་པ་ཡིན་ནོ། །
en: “Śāradvatīputra, to draw another analogy, priceless precious jewels cannot be assessed.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་དག་ང་རྒྱལ་མེད་པ་ཡིན་ནོ། །
en: Likewise, Śāradvatīputra, bodhisattvas who are irreversibly destined for awakening cannot be proud.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ལོ་ཐོག་ཡོངས་སུ་རྫོགས་པ་ནི་གཡུར་ཟའོ། །
en: “Śāradvatīputra, to draw another analogy, when the fruit of a tree are ripe, the branches will bend under their weight.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་དཀར་པོའི་ཆོས་ཡོངས་སུ་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་དོ། །
en: Likewise, Śāradvatīputra, bodhisattvas who have perfected all positive qualities bow before all beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གང་ས་ཆེན་པོ་འདི་ཚིག་པར་བྱེད་པའི་སྲེག་པའི་བསྐལ་པའི་མེ་དེ་ནི་གང་ནས་ཀྱང་མི་འོང་ངོ་། །
en: “Śāradvatīputra, to draw another analogy, the fire that burns this great earth at the end of an eon does not come from anywhere.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་མེ་གང་གིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བར་གྱུར་པའི་ཉོན་མོངས་པ་རྣམས་བསྲེགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་དག་གང་ནས་ཀྱང་མི་འོང་ངོ་། །
en: Likewise, Śāradvatīputra, the bodhisattva’s wisdom fire that consumes all afflictions, which arise through the force of habit and then leads to fully awakening to unsurpassed and perfect buddhahood, does not come from anywhere.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཚིག་པའམ། མ་ཚིག་པ་ཡང་རུང་སྟེ་ནམ་མཁའི་ངོ་བོ་ཉིད་དོ། །
en: “Śāradvatīputra, to draw another analogy, space is the essence of the worlds of the trichiliocosm, whether they are burnt or not.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཡང་རུང་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་ཡང་རུང་སྟེ་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་དོ། །
en: Likewise, Śāradvatīputra, the essence of all phenomena is awakening, whether a bodhisattva fully awakens to perfect buddhahood or not.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བསྡུ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་དཔེ་ཉེ་བར་བཀོད་པ་བསྟན་པ་འདི་དག་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་ཐོས་ནས་མོས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དཔེ་འདི་ལྟ་བུ་གྲུབ་པ་ཉིད་དུ་འགྱུར་རོ། །
en: “Śāradvatīputra, bodhisattvas who hear this presentation of analogies taught by the Thus-Gone One for the sake of gathering bodhisattvas, and are inspired by it, will all become exactly what has been analogized here.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དཔེའི་ཕྲེང་བ་བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ཉི་ཁྲི་བཞི་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When the Blessed One had taught this garland of analogies, twenty-four thousand beings developed the mind directed toward unsurpassed and perfect awakening.

source: སངས་རྒྱས་བྱང་ཆུབ་མཆོག་ཏུ་བལྟ་དཀའ་སྟེ། །
en: “A buddha’s awakening is supremely difficult to see.

source: ཟབ་ཅིང་ཕྲ་ལ་དྲི་མེད་ཅི་ཡང་མེད། །
en: It is profound, subtle, immaculate, and not even slightly real.

source: དེ་བས་མི་གང་རྣམ་འཚང་རྒྱ་འདོད་པ། །དེས་འདིར་ཆོས་རྣམས་ལ་ནི་ཐོགས་མི་བྱ། །
en: Thus, when someone wishes for awakening, They should not be obstructed by phenomena.

source: ཡེ་ཤེས་ཤིན་ཏུ་དག་ཅིང་བཅོས་མ་མིན། །ཀུན་ཏུ་སྣང་བར་གྱུར་ཅིང་འོད་གསལ་ཏེ། །
en: “Wisdom is pure and uncontrived, Totally illuminating and lucid.

source: དྲི་མེད་ཕྱག་རྒྱ་ལ་ནི་རབ་གནས་པས། །བྱང་ཆུབ་དམ་པ་འདི་ལ་རེག་པར་ནུས། །
en: Sublime awakening can be reached By maintainig this immaculate seal.

source: སྔོན་གྱི་མཐའ་འམ་ཕྱི་མའི་མཐའ་ཡང་རུང་། །སེམས་ནི་དག་ཅིང་རང་བཞིན་འོད་གསལ་ལོ། །
en: “Across the limits of both past and future, The mind is pure and its nature luminous.

source: ཉོན་མོངས་གང་གིས་ཡིད་ནི་ཉེར་ཉོན་མོངས། །དེ་དག་ཚུལ་བཞིན་གྱིས་ནི་ཡོངས་སུ་སྤངས། །
en: Any afflictive emotion causes the mind to be disturbed, So they should be properly abandoned.

source: འདི་ལ་བྱེད་པོ་མེད་ཅིང་ཚོར་པོ་མེད། །
en: “There is no agent or one who feels.

source: ཆོས་རྣམས་ཐམས་ཅད་རྗེས་མེད་ཡ་མ་བརླ། །
en: Phenomena are unreal and leave no trace.

source: གང་ཟག་མེད་ཅིང་བདག་གིས་བདག་མེད་བསྟན། །རྨི་ལམ་ངོ་བོ་ཉིད་དེ་ནམ་མཁའ་འདྲ། །
en: There is no individual and the self is shown to be selfless— In essence it is like a dream, or like space.

source: འདི་དག་ལུས་ཀྱི་ལས་ཀྱིས་རབ་ཕྱེ་མིན། །ངག་གམ་སེམས་ཀྱིས་རྣམ་པར་བརྟགས་མ་ཡིན། །
en: “Phenomena are not determined by physical actions, Nor imputed by the speech or the mind.

source: ཡང་དག་ཏུ་ན་བྱས་མིན་གཞན་མིན་ཏེ། །
en: Truly they are uncreated and not due to anything extraneous.

source: དེ་དག་ལ་ནི་དཔེ་བྱར་མི་ནུས་སོ། །
en: They cannot be described in any way.

source: ནམ་མཁའ་མཚུངས་ཤིང་དྲི་མེད་ངོ་བོ་ཉིད། །གཟུགས་ཅན་མ་ཡིན་བསྟན་དུ་ཡོད་མ་ཡིན། །མིག་གིས་ཤེས་བྱ་མ་ཡིན་རྣ་སྣས་མིན། །ལྕེ་དང་ལུས་དང་ཡིད་རྣམས་ཀྱིས་ཀྱང་མིན། །
en: “They are like space, an immaculate essence— Formless, indescribable, Not cognizable by the eye, the ear, the nose, The tongue, the body, or the mind.

source: མཚན་ཉིད་མ་ཡིན་མཚན་ཉིད་རྣམ་པར་ལོག།
en: “They have no characteristics; all characteristics miss the mark.

source: ཞི་བ་གནས་མེད་ཟླ་བའི་གཟུགས་བརྙན་འདྲ། །
en: They are peaceful and not really there, like a reflection of the moon.

source: དེ་ལ་སེམས་མི་རྒྱུ་སྟེ་ཡིད་ཀྱང་མིན། །
en: Neither mind nor thoughts can move toward them.

source: རྣམ་ཤེས་མ་ཡིན་འདུ་ཤེས་སེམས་པ་མིན། །
en: They cannot be conceived or perceived.

source: དེ་དག་ཡེ་ཤེས་ལས་དང་དེ་བཞིན་དུ། །རྣམ་པར་ཤེས་པའི་ལས་ཀྱིས་ཤེས་མི་ནུས། །
en: “They cannot be known by the action of wisdom, Nor by the action of consciousness.

source: ཡི་གེ་རྣམས་ཀྱིས་ཆོས་འདི་བསྙད་པ་གང་། །
en: This Dharma cannot be explained through language.

source: སངས་རྒྱས་ཐུགས་རྗེ་འདི་ནི་བླ་ན་མེད། །
en: The Buddha’s compassion is unsurpassable.

source: སེམས་ཅན་གང་དག་སྔོན་ཆད་བྱས་ལྡན་ཞིང་། །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཀྱང་ཡོངས་སུ་ཟིན། །དེ་དག་འདི་འདྲའི་ཆོས་འདི་ཐོས་ནས་ནི། །དགའ་བ་རྒྱ་ཆེན་ཟང་ཟིང་མེད་པ་འཐོབ། །
en: “When beings who have made preparations And been accepted by a spiritual friend Hear this Dharma, Vast and pure is their joy.

source: འདི་ནི་ཅི་སེམས་ཅི་ཞིག་བྱེད་ཅིག་ཅེས། །དེ་དག་བདུད་ཀྱིས་སྐྱོན་ཆགས་མི་རྙེད་དེ། །
en: “Māras, who can create no troubles for such beings, wonder, ‘What is he thinking? What is he doing?’

source: སེམས་དང་སེམས་ཀྱི་སྤྱོད་ཡུལ་མི་ཤེས་ན། །བར་དུ་བདུད་ལས་བྱེད་པར་ག་ལ་འགྱུར། །
en: When one has transcended conceptual mind and its domain, How can the māras ever create obstacles?

source: བདུད་བཞི་འདི་ལས་ཤིན་ཏུ་འདས་ནས་ནི། །རིགས་པ་དང་ནི་བློ་དང་བསོད་ནམས་དང་། །ཚུལ་གྱིས་སངས་རྒྱས་སྤྱོད་ཡུལ་རབ་གནས་པ། །བྱང་ཆུབ་སྤྱོད་པ་དམ་པ་འདི་ལ་སྤྱོད། །
en: “When the four māras have been transcended, One’s family, intellect, and merit Will be firmly based in the domain of buddhahood, And one will engage in awakened conduct.

source: གང་ཞིག་སེམས་ཅན་ཀུན་གྱི་སྤྱོད་ཤེས་པ། །དེ་ནི་བྱང་ཆུབ་སྤྱོད་མཆོག་འདི་ལ་སྤྱོད། །
en: “One who is aware of all beings’ conduct Will engage in supreme awakened action.

source: དེ་ཡིས་སྤྱོད་པ་རྣམ་མང་འདི་ཐོས་ནས། །དེ་ཡི་མཚན་ཉིད་ཆོས་ཀྱང་རབ་ཏུ་སྟོན། །
en: When hearing of these many kinds of conduct, One can teach the Dharma of their characteristics.

source: འགྲོ་བའི་སྤྱོད་པ་འདི་ནི་སྣ་ཚོགས་ཏེ། །ཕན་ཚུན་དམིགས་པར་ཡང་དག་རབ་ཏུ་ལྡན། །
en: “Beings’ conduct is diverse And they are always basing it on one another.

source: བདག་ཆེན་དེ་དག་སྤྱོད་ཡུལ་དེ་ཤེས་ནས། །ཕྱད་པར་ངེས་པར་བསྟན་པ་ལུང་ཡང་སྟོན། །
en: Understanding the different types of conduct, Great beings always deliver definitive teachings.

source: འདི་ན་སེམས་ཅན་ཆགས་མང་ཆགས་པ་ཡོད། །དེ་དག་ཞེ་སྡང་བག་ཉལ་རྣམ་པ་མང་། །
en: “Some beings are predominantly desirous, And many have a potential for aggression.

source: དེ་དག་ཞེ་སྡང་ཉོན་མོངས་གཟིར་བར་སྣང་། །དེ་དག་གཏི་མུག་ཆེན་པོས་གནོད་པར་གྱུར། །
en: They are tormented by their aggression And harmed by their great stupidity.

source: དེ་ལྟར་འགྲོ་བའི་སྤྱོད་པ་སྣ་ཚོགས་ཏེ། །དེ་ལ་འཇུག་པ་དང་ནི་མཚན་མ་དང་། །རྐྱེན་དང་དམིགས་པའང་ཁོང་དུ་ཆུད་བྱས་ལ། །དེ་ཡི་འོག་ཏུ་དེ་ཡི་མཚན་ཉིད་བསྟན། །
en: “When beings’ diverse conduct has been understood, And its marks, conditions, And reference points have been mastered, One can then teach their characteristics.

source: ཀུན་ནས་ཞགས་པའི་དྲ་བར་རབ་བཅུག་པ། །རིག་པ་འཛིན་པའི་སྐྱེས་བུ་མཁས་པ་གསལ། །དེས་ནི་ཞགས་པ་ཐམས་ཅད་རབ་བཅད་ནས། །ཇི་ལྟར་འདོད་པ་བཞིན་དུ་མ་སྨད་འགྲོ། །
en: “Wise beings who are learned and lucid Can slice through the ropes That tie others down in strong nets, Thus freeing them to proceed to better states as they wish.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་མཁས་པ། །
en: “Thus, bodhisattvas are heroic and learned.

source: འགྲོ་བ་ཀུན་ལ་སེམས་ཀྱི་བསམ་ཞུགས་ནས། །ཉོན་མོངས་དེ་དག་ཐམས་ཅད་རབ་བཅད་དེ། །སྒྲིབ་པ་མེད་པར་འགྲོ་བ་ཀུན་ལ་སྤྱོད། །
en: Knowing the thoughts of all beings, They destroy all their afflictions And help them to remove their obscurations.

source: ཉི་མའི་འོད་ལ་གྲོགས་ནི་བྱ་མི་དགོས། །སྦྲུལ་གདུག་ལ་ཡང་གྲོགས་བྱ་དགོས་མ་ཡིན། །
en: “The sun’s light needs no assistance, Nor does a poisonous snake.

source: སེང་གེའི་སྒྲ་ལ་གྲོགས་བྱ་མི་དགོས་ཏེ། །
en: A lion’s roar does not need to be helped.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་གྲོགས་མི་དགོས། །
en: Bodhisattvas likewise require no accompaniment.

source: དེ་དག་གྲོགས་མེད་གཅིག་པུ་གཉིས་མེད་པར། །སངས་རྒྱས་ཆོས་མང་ཡང་དག་སྒྲུབ་པར་བྱེད། །
en: “With no companion, alone, and by themselves, They accomplish many buddha qualities;

source: བརྩོན་འགྲུས་དང་ནི་མཐུ་དང་སྟོབས་སུ་ལྡན། །
en: Come to possess diligence, power, and strength;

source: འགྲོ་བའི་ཉོན་མོངས་རྣམས་ནི་རབ་ཏུ་འཇོམས། །
en: And defeat beings’ afflictions.

source: ཇི་ལྟ་ཇི་ལྟར་མེས་ནི་རྩྭ་རྙེད་པ། །དེ་ལྟ་དེ་ལྟར་དེ་སྟོབས་ཕྱིར་ཞིང་འཕེལ། །
en: “Just as the strength of a fire will grow The more grass is added to it,

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་སྲིད། །དེ་ལྟ་དེ་ལྟར་ཤེས་རབ་མེ་རབ་འཕེལ། །
en: Likewise, the more bodhisattvas experience afflictions, The stronger the fire of their insight blazes.”

source: དཔེ་བསྟན་པའི་ལེའུ་སྟེ། བཞི་པའོ།། །།
en: [Chapter Four: Teaching Through Analogies]

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke to the bodhisattva great being Sāgaramati:

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔས་བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ། །
en: “Sāgaramati, bodhisattvas must practice diligence.

source: བྱང་ཆུབ་སེམས་དཔས་རྟག་ཏུ་རྟུལ་བ་བརྟན་པ་དང་འདུན་པ་ཆེ་བར་བྱའོ། །
en: Bodhisattvas must always persevere and show great determination.

source: གཅེས་པ་མི་འདོར་བར་བྱའོ། །
en: They should not give up their dedication.

source: བློ་གྲོས་རྒྱ་མཚོ་བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྙེད་པར་དཀའ་བ་མ་ཡིན་ནོ། །
en: Sāgaramati, unsurpassed and perfect awakening is not difficult to discover for bodhisattvas who practice diligence.

source: བློ་གྲོས་རྒྱ་མཚོ་གང་ན་བརྩོན་འགྲུས་ཡོད་པ་དེ་ན་བྱང་ཆུབ་ཡོད་དོ། །
en: Sāgaramati, where there is diligence there is awakening.

source: ལེ་ལོ་ཅན་རྣམས་ལ་ནི་བྱང་ཆུབ་ཤིན་ཏུ་རིང་ཞིང་རྣམ་པར་རིང་ངོ་། །
en: Awakening is far and distant from those who are lazy.

source: ལེ་ལོ་ཅན་ལ་སྦྱིན་པ་མེད་དོ། །ལེ་ལོ་ཅན་ལ་ཚུལ་ཁྲིམས་མེད་དོ། །ལེ་ལོ་ཅན་ལ་བཟོད་པ་མེད་དོ། །ལེ་ལོ་ཅན་ལ་བརྩོན་འགྲུས་མེད་དོ། །ལེ་ལོ་ཅན་ལ་བསམ་གཏན་མེད་དོ། །ལེ་ལོ་ཅན་ལ་ཤེས་རབ་མེད་དོ། །ལེ་ལོ་ཅན་ལ་བདག་གི་དོན་མེད་དོ། །ལེ་ལོ་ཅན་ལ་གཞན་གྱི་དོན་མེད་དོ། །
en: Those who are lazy have no generosity, discipline, patience, diligence, concentration, insight, personal benefit, or benefit for others.
